<!-- dflook/terraform-github-actions {"workspace":"workflows-2","backend_type":"remote","backend":"b0a23691645c127a767e5aef53a898d3dbdedfd76a41e031c9d97777b013384a","plan_job_ref":"Job Test Terraform cloud #263 at https://github.com/dflook/terraform-github-actions/actions/runs/12447005894","plan_hash":"c15e394794c3674a5f6accbbec0556737b719e1db108f3a7a3c23284315aa0d2","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __workflows-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   default        = "default"
+   from_tfvars    = "from_tfvars"
+   from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #263](https://github.com/dflook/terraform-github-actions/actions/runs/12447005894)